Revit 2027 API
FluidType.Create Method
Overload List
Name | Description
Create(Document, String) |  Creates a new empty fluid type and adds it to the document.
Create(Document, String, FluidType) |  Creates a new fluid type and adds it to the document.
Top
See Also
Reference
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace